In [85]:
import pandas as pd
import numpy as np

In [2]:
colors = ['black', 'red', 'blue', 'yellow']
cars = ['Mercedes', 'Porsche', 'BMW', 'Nissan', 'Honda', 'Subaru']
for color in colors:
    for car in cars:
        print(color, car)

black Mercedes
black Porsche
black BMW
black Nissan
black Honda
black Subaru
red Mercedes
red Porsche
red BMW
red Nissan
red Honda
red Subaru
blue Mercedes
blue Porsche
blue BMW
blue Nissan
blue Honda
blue Subaru
yellow Mercedes
yellow Porsche
yellow BMW
yellow Nissan
yellow Honda
yellow Subaru

In [3]:
cars = ['Mercedes', 'Porsche', 'BMW', 'Nissan', 'Honda', 'Subaru']
for index, value in enumerate(cars):
    print(index, value)

0 Mercedes
1 Porsche
2 BMW
3 Nissan
4 Honda
5 Subaru

In [11]:
df = pd.DataFrame({'Order_type': [1, 4, 6, 8], 'Sector_x': [150, 350, 0, 0],  'Sector_y': [2, 2, 300, 800]})
df

   Order_type  Sector_x  Sector_y
0           1       150         2
1           4       350         2
2           6         0       300
3           8         0       800

In [8]:
order_list = [1, 4, 6, 8]
list_df = list()
for z in order_list:
    ys = df.query(f'Order_type=={z}')
    for index, value in enumerate(df):
        mask = ((df['Order_type']==6) | (df['Order_type']==8))
        df.loc[mask, "Sector_x"] = df.loc[mask, "Sector_y"]
        df["Sector_3"] = df["Sector_x"] / df["Sector_y"]
    list_df.append(ys)

In [9]:
list_df

[   Order_type  Sector_x  Sector_y  Sector_3
 0           1       150         2      75.0,
    Order_type  Sector_x  Sector_y  Sector_3
 1           4       350         2     175.0,
    Order_type  Sector_x  Sector_y  Sector_3
 2           6       300       300       1.0,
    Order_type  Sector_x  Sector_y  Sector_3
 3           8       800       800       1.0]

In [12]:
new_df = pd.concat(list_df)
new_df

   Order_type  Sector_x  Sector_y  Sector_3
0           1       150         2      75.0
1           4       350         2     175.0
2           6       300       300       1.0
3           8       800       800       1.0

In [117]:
df_1 = pd.read_excel('Adidas US Sales Datasets.xlsx')
df_1

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,Unnamed: 10,Unnamed: 11,Unnamed: 12,Unnamed: 13
0,NaN,NaN,Adidas Sales Database,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,NaN,Retailer,Retailer ID,Invoice Date,Region,State,City,Product,Price per Unit,Units Sold,Total Sales,Operating Profit,Operating Margin,Sales Method
4,NaN,Foot Locker,1185732,2020-01-01 00:00:00,Northeast,New York,New York,Men's Street Footwear,50,1200,600000,300000,0.5,In-store
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
9647,NaN,Foot Locker,1185732,2021-01-24 00:00:00,Northeast,New Hampshire,Manchester,Men's Apparel,50,64,3200,896.0,0.28,Outlet
9648,NaN,Foot Locker,1185732,2021-01-24 00:00:00,Northeast,New Hampshire,Manchester,Women's Apparel,41,105,4305,1377.6,0.32,Outlet
9649,NaN,Foot Locker,1185732,2021-02-22 00:00:00,Northeast,New Hampshire,Manchester,Men's Street Footwear,41,184,7544,2791.28,0.37,Outlet
9650,NaN,Foot Locker,1185732,2021-02-22 00:00:00,Northeast,New Hampshire,Manchester,Men's Athletic Footwear,42,70,2940,1234.8,0.42,Outlet
9651,NaN,Foot Locker,1185732,2021-02-22 00:00:00,Northeast,New Hampshire,Manchester,Women's Street Footwear,29,83,2407,649.89,0.27,Outlet

In [118]:
df_1.shape

(9652, 14)

In [119]:
df_1 = df_1.drop('Unnamed: 0',axis=1)

In [120]:
df_1 = df_1.drop(labels=[0,1,2], axis=0)

In [121]:
df_1.columns = df_1.iloc[0]

In [122]:
df_1 = df_1.drop(labels=3, axis=0)

In [123]:
df_1 = df_1.reset_index(drop=True)

In [124]:
df_1

3,Retailer,Retailer ID,Invoice Date,Region,State,City,Product,Price per Unit,Units Sold,Total Sales,Operating Profit,Operating Margin,Sales Method
0,Foot Locker,1185732,2020-01-01 00:00:00,Northeast,New York,New York,Men's Street Footwear,50,1200,600000,300000,0.5,In-store
1,Foot Locker,1185732,2020-01-02 00:00:00,Northeast,New York,New York,Men's Athletic Footwear,50,1000,500000,150000,0.3,In-store
2,Foot Locker,1185732,2020-01-03 00:00:00,Northeast,New York,New York,Women's Street Footwear,40,1000,400000,140000,0.35,In-store
3,Foot Locker,1185732,2020-01-04 00:00:00,Northeast,New York,New York,Women's Athletic Footwear,45,850,382500,133875,0.35,In-store
4,Foot Locker,1185732,2020-01-05 00:00:00,Northeast,New York,New York,Men's Apparel,60,900,540000,162000,0.3,In-store
...,...,...,...,...,...,...,...,...,...,...,...,...,...
9643,Foot Locker,1185732,2021-01-24 00:00:00,Northeast,New Hampshire,Manchester,Men's Apparel,50,64,3200,896.0,0.28,Outlet
9644,Foot Locker,1185732,2021-01-24 00:00:00,Northeast,New Hampshire,Manchester,Women's Apparel,41,105,4305,1377.6,0.32,Outlet
9645,Foot Locker,1185732,2021-02-22 00:00:00,Northeast,New Hampshire,Manchester,Men's Street Footwear,41,184,7544,2791.28,0.37,Outlet
9646,Foot Locker,1185732,2021-02-22 00:00:00,Northeast,New Hampshire,Manchester,Men's Athletic Footwear,42,70,2940,1234.8,0.42,Outlet
9647,Foot Locker,1185732,2021-02-22 00:00:00,Northeast,New Hampshire,Manchester,Women's Street Footwear,29,83,2407,649.89,0.27,Outlet

In [125]:
df_1['Invoice Date'] = pd.to_datetime(df_1['Invoice Date'])
df_1 = df_1.set_index('Invoice Date').sort_values(by='Invoice Date',ascending=True)
df_1

3,Retailer,Retailer ID,Region,State,City,Product,Price per Unit,Units Sold,Total Sales,Operating Profit,Operating Margin,Sales Method
Invoice Date,,,,,,,,,,,,
2020-01-01,Foot Locker,1185732,Northeast,New York,New York,Men's Street Footwear,50,1200,600000,300000,0.5,In-store
2020-01-01,Foot Locker,1185732,Northeast,Pennsylvania,Philadelphia,Women's Apparel,75,275,206250,61875,0.3,Outlet
2020-01-01,Foot Locker,1185732,Northeast,Pennsylvania,Philadelphia,Women's Apparel,53,83,4399,1407.68,0.32,Outlet
2020-01-01,Foot Locker,1185732,Northeast,New York,New York,Men's Street Footwear,47,336,15792,9633.12,0.61,Online
2020-01-01,Foot Locker,1185732,Northeast,New York,New York,Men's Street Footwear,34,384,13056,6789.12,0.52,Outlet
...,...,...,...,...,...,...,...,...,...,...,...,...
2021-12-31,Foot Locker,1185732,Northeast,Pennsylvania,Philadelphia,Men's Apparel,70,175,122500,42875,0.35,Outlet
2021-12-31,Foot Locker,1185732,Northeast,Pennsylvania,Philadelphia,Men's Apparel,63,47,2961,1362.06,0.46,Online
2021-12-31,Foot Locker,1185732,Northeast,Pennsylvania,Philadelphia,Men's Apparel,46,56,2576,1004.64,0.39,Outlet
2021-12-31,Amazon,1185732,Northeast,Maine,Portland,Men's Apparel,52,36,1872,692.64,0.37,Online
2021-12-31,Amazon,1185732,Northeast,Maine,Portland,Men's Apparel,55.0,125,68750.0,17187.5,0.25,Outlet

In [126]:
df_1.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 9648 entries, 2020-01-01 to 2021-12-31
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Retailer          9648 non-null   object
 1   Retailer ID       9648 non-null   object
 2   Region            9648 non-null   object
 3   State             9648 non-null   object
 4   City              9648 non-null   object
 5   Product           9648 non-null   object
 6   Price per Unit    9648 non-null   object
 7   Units Sold        9648 non-null   object
 8   Total Sales       9648 non-null   object
 9   Operating Profit  9648 non-null   object
 10  Operating Margin  9648 non-null   object
 11  Sales Method      9648 non-null   object
dtypes: object(12)
memory usage: 979.9+ KB

In [127]:
dff = df_1.groupby([pd.PeriodIndex(df_1.index, freq="D"), 'Product'])[
                        ['Units Sold','Price per Unit']].agg({'Units Sold':'sum', 'Price per Unit':'mean'})
dff

3                                      Units Sold Price per Unit
Invoice Date Product
2020-01-01   Men's Street Footwear           1920      43.666667
             Women's Apparel                  441      65.333333
2020-01-02   Men's Athletic Footwear         1580      44.333333
             Men's Street Footwear            730      31.333333
2020-01-03   Men's Athletic Footwear          702      41.333333
...                                           ...            ...
2021-12-27   Men's Street Footwear           1314           59.6
2021-12-28   Men's Athletic Footwear          749           51.6
2021-12-29   Women's Street Footwear          557           49.0
2021-12-30   Women's Athletic Footwear        442           48.8
2021-12-31   Men's Apparel                    439           57.2

[2158 rows x 2 columns]

In [132]:
total_revenue = [] 
for date in df_1.index.get_level_values(0).unique():
    total = 0
    for product in df_1.loc[date].index.get_level_values(0):
             total = dff['Units Sold'] * dff['Price per Unit']
    total_revenue.append(total)

In [133]:
total_revenue[0]

Invoice Date  Product
2020-01-01    Men's Street Footwear             83840.0
              Women's Apparel                   28812.0
2020-01-02    Men's Athletic Footwear      70046.666667
              Men's Street Footwear        22873.333333
2020-01-03    Men's Athletic Footwear           29016.0
                                               ...
2021-12-27    Men's Street Footwear             78314.4
2021-12-28    Men's Athletic Footwear           38648.4
2021-12-29    Women's Street Footwear           27293.0
2021-12-30    Women's Athletic Footwear         21569.6
2021-12-31    Men's Apparel                     25110.8
Length: 2158, dtype: object

In [144]:
df_total_revenue.set_axis(["REV"], axis="columns")

                                                 REV
Invoice Date Product
2020-01-01   Men's Street Footwear           83840.0
             Women's Apparel                 28812.0
2020-01-02   Men's Athletic Footwear    70046.666667
             Men's Street Footwear      22873.333333
2020-01-03   Men's Athletic Footwear         29016.0
...                                              ...
2021-12-27   Men's Street Footwear           78314.4
2021-12-28   Men's Athletic Footwear         38648.4
2021-12-29   Women's Street Footwear         27293.0
2021-12-30   Women's Athletic Footwear       21569.6
2021-12-31   Men's Apparel                   25110.8

[2158 rows x 1 columns]